function [NUp,NL,NR] = p2up(N)
%	------------------- 计算信号延拓长度 -------------------- 
%Input:
%       N:信号长度
%Output:
%       NUp:扩展后信号长度
%       NL:左端扩展后长度
%       NR:右端扩展后长度
%---------------------------------------------------------------------------------
%    Synchrosqueezing Toolbox
%    Authors: 何周杰（2019/1/8）
%---------------------------------------------------------------------------------
    NUp = 2^(ceil(log2(N+eps))+1);
    NL = floor((NUp-N)/2);
    NR = NL;
    if (mod(2*NL+N,2)==1)
        NR = NL + 1; 
    end
end